src/main/java/ConfigurationResources/SOAP/UploadFileToUCM.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"  xmlns:ucm="http://www.oracle.com/UCM"xmlns:wsse="http://schemas.xmlsoap.org/ws/2003/06/secext">   <soapenv:Header/>   <soapenv:Body>      <ucm:GenericRequest webKey="cs">         <ucm:Service IdcService="CHECKIN_UNIVERSAL">            <ucm:User/>            <ucm:Document>               <ucm:Field name="dDocTitle">Sample File</ucm:Field>               <ucm:Field name="dDocType">Document</ucm:Field>               <ucm:Field name="dDocAuthor">pimqa</ucm:Field>               <ucm:Field name="dSecurityGroup">FAFusionImportExport</ucm:Field>               <ucm:Field name="dDocAccount">scm$/item$/import$</ucm:Field>               <ucm:Field name="primaryFile">SampleFile.doc</ucm:Field>               <ucm:File href="SampleFile.doc" name="primaryFile">                  <ucm:Contents>VGVzdGluZyBmaWxlIGF0dGFjaG1lbnQu</ucm:Contents>               </ucm:File>            </ucm:Document>         </ucm:Service>      </ucm:GenericRequest>   </soapenv:Body></soapenv:Envelope>