Rolecall_To_Fusion/Rolecall_To_Fusion/Files/RoleCall_FU/Fusion/DimensionMaster/10.Delete file from UCM/Request/Request.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ucm="http://www.oracle.com/UCM">
   <soapenv:Header/>
   <soapenv:Body>
      <ucm:GenericRequest webKey="cs">
         <ucm:Service IdcService="DELETE_DOC">
            <ucm:Document>
               <ucm:Field name="dDocName">UCMFA00044633 </ucm:Field>
               <ucm:Field name="RevisionSelectionMethod">Latest</ucm:Field>
            </ucm:Document>
         </ucm:Service>
      </ucm:GenericRequest>
   </soapenv:Body>
</soapenv:Envelope>
